import sys, socket, time

#порты, которые могут быть открыты
ports = [20, 21, 22, 23, 25, 42, 43, 53, 67, 69, 80, 110, 115, 123, 137, 138, 139, 143, 161, 179, 443, 445, 514, 515, 993,  995, 1080, 1194, 1702, 1723, 3128, 3268, 3306, 3389, 5432, 5060, 5900, 5938, 8080, 10000, 20001]

print("Сканер портов")

print("")
name = input("Введите имя или ip-адрес: ")
#Ну вы поняли короч))))
print("Идет сканирование портов.")
time.sleep(3)
print("Идет сканирование портов..")
time.sleep(3)
print("Идет сканирование портов...")
time.sleep(3)

for port in ports:
    socc = socket.socket() #создаем сокет
    socc.settimeout(1) #время для сокета
    try:
        socc.connect((name, port)) #подключение к удаленному сокету
    except Exception as err:
        print(err)
    else:
        socc.close() #закрываем соединение
        print(name + " - " + str(port) + ' открытые порты') #выводим на экран открытые порты

print("процесс завершен")
